app/views/books/show.html.erb

<% if params[:from] == "user" && params[:user_id].present? %>
  <% origin_user = User.find_by(id: params[:user_id]) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1