app/controllers/books_controller.rb

  def create
    current_user = User.first
    @book = current_user.books.build(book_params)
    if @book.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "books" ("title", "author", "user_id", "created_at", "updated_at") VALUES ('てすと', 'てすと', 1, '2025-11-06 01:12:01.113185', '2025-11-06 01:12:01.113185') RETURNING "id"

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
UPDATE "books" SET "title" = '編集のてすと', "author" = '編集のてすと', "updated_at" = '2025-11-07 02:07:37.759251' WHERE "books"."id" = 1

  def destroy
    @book = Book.find(params[:id])
    @book.destroy
---
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
DELETE FROM "books" WHERE "books"."id" = 1