app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 3
---
  def destroy

    user = User.find(params[:id])
    user.destroy